动态规划.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-29 Mon 02:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>动态规划</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dctrl" />
<link rel="stylesheet" type="text/css" href="/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">动态规划</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0d8390a">1. 0-1背包</a></li>
<li><a href="#org100fe37">2. 最小编辑距离</a></li>
<li><a href="#org0560c48">3. 最长单调递增子序列</a></li>
<li><a href="#org5ba3a05">4. 编辑距离问题 &#x2013; 转</a></li>
<li><a href="#orgfe5deca">5. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0d8390a" class="outline-2">
<h2 id="org0d8390a"><span class="section-number-2">1</span> 0-1背包</h2>
</div>
<div id="outline-container-org100fe37" class="outline-2">
<h2 id="org100fe37"><span class="section-number-2">2</span> 最小编辑距离</h2>
</div>
<div id="outline-container-org0560c48" class="outline-2">
<h2 id="org0560c48"><span class="section-number-2">3</span> 最长单调递增子序列</h2>
<div class="outline-text-2" id="text-3">
<p>
即找到一个给定序列的最长递增子序列，如{3, 2, 1 , 4, 5, 2, 6}的最长递增子序列为：{3, 4, 5, 6}
</p>

<p>
此问题，即原问题从最长递增子序列，“降解”为，当序列以$a_i$为最末尾元素时，仅存在如下两种情形：
</p>

<p>
1.当前序列为仅包含$a_i$的序列
2.当前序列为在满足 <b>j&lt;i</b> 且 \(a_j\) &lt; \(a_i\) 的前提下，将 \(a_i\) 添加到“旧”子序列的子序列。
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #61bfff;">int</span> <span style="color: #f8f8f2;">array</span>[n];

<span style="color: #61bfff;">int</span> <span style="color: #50fa7b;">dp</span>()
{
  <span style="color: #61bfff;">int</span> []dp_maze = <span style="color: #ff79c6;">new</span> <span style="color: #61bfff;">int</span>[n];

  <span style="color: #ff79c6;">for</span>(<span style="color: #61bfff;">int</span> <span style="color: #f8f8f2;">i</span> = 0;i &lt; n;i++)
  {
     dp_maze[i] = 1;
     <span style="color: #ff79c6;">for</span>(<span style="color: #61bfff;">int</span> <span style="color: #f8f8f2;">j</span> = 0;j &lt; i;j++)
     { 
     <span style="color: #ff79c6;">if</span>( dp_maze[j] &lt; dp_maze[i] &amp;&amp; array[j] &gt; array[i] - 1 )
        dp_maze[i] = dp_maze[j] + 1;
     }
   }

   <span style="color: #ff79c6;">return</span> dp_maze[n-1];
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ba3a05" class="outline-2">
<h2 id="org5ba3a05"><span class="section-number-2">4</span> 编辑距离问题 &#x2013; 转</h2>
<div class="outline-text-2" id="text-4">
<p>
操作允许三种：插入一个字符、删除一个字符、替换一个字符
</p>

<p>
假设字符串 a, 共 m 位，从 a[1] 到 a[m]
字符串 b, 共 n 位，从 b[1] 到 b[n]
d[i][j] 表示字符串 a[1]-a[i] 转换为 b[1]-b[j] 的编辑距离
</p>

<p>
那么有如下递归规律（a[i] 和 b[j] 分别是字符串 a 和 b 的最后一位）：
</p>

<p>
当 a[i] 等于 b[j] 时，d[i][j] = d[i-1][j-1], 比如 fxy -&gt; fay 的编辑距离等于 fx -&gt; fa 的编辑距离
</p>

<p>
当 a[i] 不等于 b[j] 时，d[i][j] 等于如下 3 项的最小值：
</p>

<p>
d[i-1][j] + 1（删除 a[i]）， 比如 fxy -&gt; fab 的编辑距离 = fx -&gt; fab 的编辑距离 + 1
</p>

<p>
d[i][j-1] + 1（插入 b[j])， 比如 fxy -&gt; fab 的编辑距离 = fxyb -&gt; fab 的编辑距离 + 1 = fxy -&gt; fa 的编辑距离 + 1
</p>

<p>
d[i-1][j-1] + 1（将 a[i] 替换为 b[j]）， 比如 fxy -&gt; fab 的编辑距离 = fxb -&gt; fab 的编辑距离 + 1 = fx -&gt; fa 的编辑距离 + 1
</p>

<p>
递归边界：
</p>

<p>
a[i][0] = i, b 字符串为空，表示将 a[1]-a[i] 全部删除，所以编辑距离为 i
</p>

<p>
a[0][j] = j, a 字符串为空，表示 a 插入 b[1]-b[j]，所以编辑距离为 j
</p>

<p>
i,j 的前移，即完成了相应的搜索过程。
</p>
<pre class="example">
int edit_distance(char *a, char *b, int i, int j)
{
    if (j == 0) {
	return i;
    } else if (i == 0) {
	return j;
    // 算法中 a, b 字符串下标从 1 开始，c 语言从 0 开始，所以 -1
    } else if (a[i-1] == b[j-1]) {
	return edit_distance(a, b, i - 1, j - 1);
    } else {
	return min_of_three(edit_distance(a, b, i - 1, j) + 1,
			    edit_distance(a, b, i, j - 1) + 1,
			    edit_distance(a, b, i - 1, j - 1) + 1);
    }
}

edit_distance(stra, strb, strlen(stra), strlen(strb));
</pre>

<p>
动态规划的解法
</p>

<p>
即颠倒过来，从前往后算。没什么好说的。
</p>

<pre class="example">
int edit_distance(char *a, char *b)
{
    int lena = strlen(a);
    int lenb = strlen(b);
    int d[lena+1][lenb+1];
    int i, j;

    for (i = 0; i &lt;= lena; i++) {
	d[i][0] = i;
    }
    for (j = 0; j &lt;= lenb; j++) {
	d[0][j] = j;
    }

    for (i = 1; i &lt;= lena; i++) {
	for (j = 1; j &lt;= lenb; j++) {
	    // 算法中 a, b 字符串下标从 1 开始，c 语言从 0 开始，所以 -1
	    if (a[i-1] == b[j-1]) {
		d[i][j] = d[i-1][j-1];
	    } else {
		d[i][j] = min_of_three(d[i-1][j]+1, d[i][j-1]+1, d[i-1][j-1]+1);
	    }
	}
    }

    return d[lena][lenb];
}
</pre>
</div>
</div>
<div id="outline-container-orgfe5deca" class="outline-2">
<h2 id="orgfe5deca"><span class="section-number-2">5</span> 参考</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://www.zhihu.com/question/23995189">动态规划的本质</a>
</p>

<p>
<a href="http://www.hawstein.com/posts/dp-novice-to-advanced.html">动态规划：从新手到专家</a>
</p>

<p>
<a href="https://www.dreamxu.com/books/dsa/dp/edit-distance.html">编辑距离 (Edit distance)</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dctrl</p>
<p class="date">Created: 2018-10-29 Mon 02:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
